# Pitch Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem..::..Pitch Property
RebarContainerItem Class See Also
---
For a spiral, the pitch, or vertical distance traveled in one rotation.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double Pitch { get; set; }
```

Visual Basic
---
```text
Public Property Pitch As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Pitch {
	double get ();
	void set (double value);
}
```

# Remarks
Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: pitch must be positive. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This RebarContainerItem is not an instance of a spiral shape. |

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace